IDEA Open Model
PositionRelatedTo Enumeration
Compatible with IDEA StatiCa Beta 20.0
 Position, to which is input related to.
 Namespace: IdeaRS.OpenModel.Parameters
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public enum PositionRelatedTo
Public Enumeration PositionRelatedTo
Members
Member name | Value | Description
Axis | 0 |  Position is related to any axis.
TopOfSteel | 1 |  Position is related to top of steel.
Profile | 2 |  Position is related to the related profile (cross-section) bounding box. In this case is Rows and Cols position are on the positive axes (top, right), RowsNegative and ColsNegative are on the negative axes.
LeftSide | 3 |  Position is related to the left side of main plate.
RightSide | 4 |  Position is related to the right side of main plate.
See Also
Reference
IdeaRS.OpenModel.Parameters Namespace